results/run-05vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 5 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  01.0s/30s

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 5 VUs  02.0s/30s

running (0m03.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  03.0s/30s

running (0m04.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  04.0s/30s

running (0m05.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [  17% ] 5 VUs  05.0s/30s

running (0m06.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  06.0s/30s

running (0m06.2s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  06.2s/30s

running (0m06.2s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  06.2s/30s

running (0m06.3s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  06.3s/30s

running (0m06.3s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  06.3s/30s

running (0m06.4s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  06.4s/30s

running (0m06.4s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  21% ] 5 VUs  06.4s/30s

running (0m06.5s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  06.5s/30s

running (0m06.6s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  22% ] 5 VUs  06.6s/30s

running (0m06.9s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  06.9s/30s

running (0m06.9s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  06.9s/30s

running (0m07.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  07.0s/30s

running (0m08.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  27% ] 5 VUs  08.0s/30s

running (0m09.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  09.0s/30s

running (0m09.8s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  09.8s/30s

running (0m09.8s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  09.8s/30s

running (0m09.8s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  09.8s/30s

running (0m09.8s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  09.8s/30s

running (0m09.9s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  09.9s/30s

running (0m09.9s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  09.9s/30s

running (0m10.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  10.0s/30s

running (0m10.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  10.0s/30s

running (0m10.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  10.0s/30s

running (0m10.1s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  10.1s/30s

running (0m10.1s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  10.1s/30s

running (0m10.2s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  10.2s/30s

running (0m10.2s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  10.2s/30s

running (0m10.3s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  10.3s/30s

running (0m10.3s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 5 VUs  10.3s/30s

running (0m10.5s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  35% ] 5 VUs  10.5s/30s

running (0m10.7s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  10.7s/30s

running (0m11.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  11.0s/30s

running (0m11.2s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  37% ] 5 VUs  11.2s/30s

running (0m12.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  12.0s/30s

running (0m13.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  13.0s/30s

running (0m14.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  47% ] 5 VUs  14.0s/30s

running (0m15.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  15.0s/30s

running (0m16.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  16.0s/30s

running (0m17.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  57% ] 5 VUs  17.0s/30s

running (0m18.0s), 5/5 VUs, 59 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  18.0s/30s

running (0m19.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  19.0s/30s

running (0m19.6s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  19.6s/30s

running (0m19.6s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  19.6s/30s

running (0m19.6s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  65% ] 5 VUs  19.6s/30s

running (0m19.7s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.7s/30s

running (0m19.7s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.7s/30s

running (0m19.7s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.7s/30s

running (0m19.7s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.7s/30s

running (0m19.7s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.7s/30s

running (0m19.7s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.7s/30s

running (0m19.7s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.7s/30s

running (0m19.8s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.8s/30s

running (0m19.8s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.8s/30s

running (0m19.8s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.8s/30s

running (0m19.8s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.8s/30s

running (0m19.8s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.8s/30s

running (0m19.8s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.8s/30s

running (0m19.9s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.9s/30s

running (0m19.9s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.9s/30s

running (0m19.9s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.9s/30s

running (0m19.9s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.9s/30s

running (0m19.9s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.9s/30s

running (0m20.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  20.0s/30s

running (0m20.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  20.0s/30s

running (0m20.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  20.0s/30s

running (0m20.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  20.0s/30s

running (0m20.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
default   [  67% ] 5 VUs  20.0s/30s

running (0m21.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  21.0s/30s

running (0m22.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  22.0s/30s

running (0m23.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  77% ] 5 VUs  23.0s/30s

running (0m24.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  24.0s/30s

running (0m25.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  25.0s/30s

running (0m26.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  87% ] 5 VUs  26.0s/30s

running (0m26.4s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.4s/30s

running (0m26.4s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.4s/30s

running (0m26.5s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.5s/30s

running (0m26.5s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.5s/30s

running (0m26.5s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.5s/30s

running (0m26.5s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.5s/30s

running (0m26.5s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.5s/30s

running (0m26.5s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.5s/30s

running (0m26.5s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.5s/30s

running (0m26.5s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  88% ] 5 VUs  26.5s/30s

running (0m26.6s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.6s/30s

running (0m26.6s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.6s/30s

running (0m26.6s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.6s/30s

running (0m26.6s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.6s/30s

running (0m26.6s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.6s/30s

running (0m26.6s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.6s/30s

running (0m26.6s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.6s/30s

running (0m26.6s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.6s/30s

running (0m26.7s), 5/5 VUs, 89 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.7s/30s

running (0m27.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  27.0s/30s

running (0m28.0s), 5/5 VUs, 94 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  28.0s/30s

running (0m29.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  97% ] 5 VUs  29.0s/30s

running (0m30.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  30.0s/30s

running (0m31.0s), 1/5 VUs, 104 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......: 105     3.382752/s
    checks_succeeded...: 100.00% 105 out of 105
    checks_failed......: 0.00%   0 out of 105

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=197.19ms min=56.23ms med=213.89ms max=518.84ms p(90)=308.48ms p(95)=309.14ms
      { expected_response:true }...: avg=197.19ms min=56.23ms med=213.89ms max=518.84ms p(90)=308.48ms p(95)=309.14ms
    http_req_failed................: 0.00%  0 out of 210
    http_reqs......................: 210    6.765504/s

    EXECUTION
    iteration_duration.............: avg=1.46s    min=1.27s   med=1.43s    max=2.88s    p(90)=1.43s    p(95)=1.56s   
    iterations.....................: 105    3.382752/s
    vus............................: 1      min=1        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 427 kB 14 kB/s
    data_sent......................: 27 kB  869 B/s



running (0m31.0s), 0/5 VUs, 105 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  30s